[
    {"Normalizasyon":"Normalizasyon veri değerlerini yeniden boyutlandırma işlemidir. Verileri 0 ile 1 arasına boyutlandırır. Bu yöntem aykırı (uç) veriler olduğunda makine öğrenmesi algoritmasının bu uç verilerden etkilenmemesi için kullanılır. Ayrıca makine öğrenmesi algoritmasının daha performanslı çalışması için de kullanılabilir. Ayrıca, yalnızca 0 - 1 aralığında değer kabûl eden bir makine öğrenim algoritmasına verileri vermeden evvel verileri normalizasyon işlemine tâbi tutmak gerekir"},
    {"Standardizasyon":"Normalizasyon veri değerlerini yeniden boyutlandırma işlemidir. Bu yöntemde veriler standart sapması 1, ortalaması ise 0 olacak şekilde yeniden boyutlandılır. Bu yöntem verilerin standart sapmaya göre ne durumda olduğunu anlamak, veriler arasındaki değişkenliğe odaklanmak istediğimizde kullanılabilir. Standardizasyon yönteminde veriler belli bir aralığa ölçeklenmediğinden aykırı değerlerden daha az etkilendiği söylenebilir."},
    {"Eksik veriler":"Veri biliminde eksik verileri işleme önemli bir konudur. Eksik veriler makine öğrenim algoritmasının performansını düşürebilir; bu sebeple eksik verileri doldurmak iyi bir fikirdir. Bunun için de pek çok yöntem vardır. En basit yöntemlerden birisi sütun verilerini ortalama ile doldurmaktır; bu, makine öğrenmesi algoritmasının performans düşüşünü engellemek için kullanılabilecek en basit yöntemlerden birisidir. Listedeli diğer yöntemlere de bakabilirsiniz"},
    {"Kategorik kodlama":"Kategorik kodlama, sayısal verilerle çalışan makine öğrenmesi algoritmasına metînsel ve kategorik verileri verebilmek için kullanılan yöntemlerin genel ismidir. Kategorik kodlama ile metînsel veriler, bitsel veriler sayısal verilere çevrilebilir. Burada önemli olan doğru yöntemi seçmektir.Bitsel kodlama iki kategoriden oluşan sütun verilerinde kullanılan yöntemdir. Kategorinin birine '1' değeri atanır, diğerine '0' değeri atanır. Sıralı kodlama birbirleri arasında bir büyüklük ilişkisi bulunan kategorik verilerde her kategoriye bir sayı atanması işlemidir. En büyük sayıya diğer kategorilerden üstün olan kategori atanmalıdır. Misal, kişinin eğitim seviyesi bu türden bir veridir. Lisans eğitimi, lise eğitiminden üstün olduğu için lisans eğitimine '2', lise eğitimine '1' değeri atanarak sütun kodlanabilir.Tek nokta vektörü biçiminde kodlama birbirleri arasında belirli bir büyüklük ilişkisi olmayan kategorileri kodlamak için kullanılan yöntemdir. Bu yöntemde her kategori bir sütun olur ve yalnızca o sınıfa âit olan verilerin değeri 'true' (1) olur. Böylece makine öğrenmesi algoritmasının yanlış katsayılar hesaplamasının önüne geçilebilirMisal: [Sivas, Erzurum, Malatya] verileri için kategorik kodlama şu şekilde olur: [1, 0, 0], [0, 1, 0], [0, 0, 1]"},
    {"İstatistikler":"Veri biliminde istatistiklerin ne anlama geldiğini bilmek çok önemlidir. Standart sapma : Verinin aritmetik ortalamadan ne kadar uzak düştüğünü ifâde eder.  Varyans : Verilerin yayılışının ortalama değerini ifâde eder. Varyansın küçük yâ dâ büyük olması sivrilik hakkında fikir verir; varyansı büyük olan dağılım daha basıktır, veri setindeki değişkenliğin ölçüsüdür. Çarpıklık : Dağılımın ortalama etrafındaki simetriden ne kadar saptığını ifâde eder. Ç = 0 ise simetriktir,  Ç > 0 ise sağa çarpıktır,  Ç < 0 sola çarpıktır. Basıklık : Çarpıklığın sivrilik derecesini gösterir. B > 0 ise dağılım sivridir, B < 0 ise dağılım basıktır"},
    {"Aykırı veriler":"Aykırı veriler veri dağılımını bozan ve makine öğrenmesi algoritmasının bir değişkene gereğinden fazla katsayı ataması gibi sonuçlara yol açabilen ortalamadan çok uzak olan uç verilerdir. Aykırı verileri ele almak, makine öğrenmesi algoritmasının performansını arttırabilir."}
]